  [{
    "index": 59,
    "name": "Contact Other Plane",
    "desc": [
      "You mentally contact a demigod, the spirit of a long-dead sage, or some other mysterious entity from another plane. Contacting this extraplanar intelligence can strain or even break your mind. When you cast this spell, make a DC 15 intelligence saving throw. On a failure, you take 6d6 psychic damage and are insane until you finish a long rest. While insane, you can't take actions, can't understand what other creatures say, can't read, and speak only in gibberish. A greater restoration spell cast on you ends this effect.",
      "On a successful save, you can ask the entity up to five questions. You must ask your questions before the spell ends. The DM answers each question with one word, such as \"yes,\" \"no,\" \"maybe,\" \"never,\" \"irrelevant,\" or \"unclear\" (if the entity doesn't know the answer to the question). If a one-word answer would be misleading, the DM might instead offer a short phrase as an answer."
    ],
    "page": "phb 226",
    "range": "Self",
    "components": ["V"],
    "ritual": true,
    "duration": "1 minute",
    "concentration": false,
    "casting_time": "1 minute",
    "level": 5,
    "school": {
      "name": "Divination",
      "url": "http://www.dnd5eapi.co/api/magic-schools/3"
    },
    "classes": [
      {
        "name": "Warlock",
        "url": "http://www.dnd5eapi.co/api/classes/11"
      },
      {
        "name": "Wizard",
        "url": "http://www.dnd5eapi.co/api/classes/12"
      }
    ],
    "subclasses": [],
    "url": "http://www.dnd5eapi.co/api/spells/59"
  },
 {
    "index": 159,
    "name": "Hideous Laughter",
    "desc": [
      "A creature of your choice that you can see within range perceives everything as hilariously funny and falls into fits of laughter if this spell affects it. The target must succeed on a wisdom saving throw or fall prone, becoming incapacitated and unable to stand up for the duration. A creature with an Intelligence score of 4 or less isn't affected.",
      "At the end of each of its turns, and each time it takes damage, the target can make another wisdom saving throw. The target had advantage on the saving throw if it's triggered by damage. On a success, the spell ends."
    ],
    "page": "phb 280",
    "range": "30 feet",
    "components": ["V", "S", "M"],
    "material": "Tiny tarts and a feather that is waved in the air.",
    "ritual": false,
    "duration": "Up to 1 minute",
    "concentration": true,
    "casting_time": "1 action",
    "level": 1,
    "school": {
      "name": "Enchantment",
      "url": "http://www.dnd5eapi.co/api/magic-schools/4"
    },
    "classes": [
      {
        "name": "Bard",
        "url": "http://www.dnd5eapi.co/api/classes/2"
      },
      {
        "name": "Wizard",
        "url": "http://www.dnd5eapi.co/api/classes/12"
      }
    ],
    "subclasses": [
      {
        "name": "Lore",
        "url": "http://www.dnd5eapi.co/api/subclasses/2"
      }
    ],
    "url": "http://www.dnd5eapi.co/api/spells/159"
  }, 
{
    "index": 119,
    "name": "Fireball",
    "desc": [
      "A bright streak flashes from your pointing finger to a point you choose within range and then blossoms with a low roar into an explosion of flame. Each creature in a 20-foot-radius sphere centered on that point must make a dexterity saving throw. A target takes 8d6 fire damage on a failed save, or half as much damage on a successful one.",
      "The fire spreads around corners. It ignites flammable objects in the area that aren't being worn or carried."
    ],
    "higher_level": [
      "When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d6 for each slot level above 3rd."
    ],
    "page": "phb 241",
    "range": "150 feet",
    "components": ["V", "S", "M"],
    "material": "A tiny ball of bat guano and sulfur.",
    "ritual": false,
    "duration": "Instantaneous",
    "concentration": false,
    "casting_time": "1 action",
    "level": 3,
    "school": {
      "name": "Evocation",
      "url": "http://www.dnd5eapi.co/api/magic-schools/5"
    },
    "classes": [
      {
        "name": "Sorcerer",
        "url": "http://www.dnd5eapi.co/api/classes/10"
      },
      {
        "name": "Wizard",
        "url": "http://www.dnd5eapi.co/api/classes/12"
      }
    ],
    "subclasses": [
      {
        "name": "Lore",
        "url": "http://www.dnd5eapi.co/api/subclasses/2"
      },
      {
        "name": "Fiend",
        "url": "http://www.dnd5eapi.co/api/subclasses/11"
      }
    ],
    "url": "http://www.dnd5eapi.co/api/spells/119"
  }]